<template>
    <div class="container">
        <div class="row" >
            <div class="col-sm-1">
                <a v-on:click="back" style="width:6%;height:6%;color:black;cursor: pointer;"> <img src="../assets/back.svg" alt=""> </a>
            </div>
            <div class="col-sm">
                <p class="h2" style="font-weight:600;">Сахарный диабет</p>
            </div>
        </div>

        <div class="row mt-5">
            <p class="lead">
                Диабет II типа —  это хроническое повышение концентрации глюкозы в крови. Главное отличие диабета данного типа – невосприимчивость клеток тела к действию гормона инсулина, т.е. их инсулинорезистентность. У здорового человека инсулин «дает команду» клеточным мембранам различных тканей «пропустить внутрь» глюкозу – основной источник энергии. У больного сахарным диабетом II типа клетки не воспринимают «команд» инсулина, и мембрана остается «на замке».
            </p>
            <p class="lead mt-2">
                Оно становится все более распространенным по всему миру. Согласно последним данным, только за последние 10 лет количество больных увеличилось на 60%. На диабет второго типа приходится приблизительно 90% всех больных диабетом II. Вне зависимости от того, для кого вы ищете информацию — для себя, своего супруга/супруги или близкого человека — в любом случае важно разобраться в причинах, симптомах и доступных видах лечения диабета.
            </p>
        </div>
        <div class="row mt-5">
            <p class="h4">Основные причины:</p>
            <p class="lead">Вкратце рассматривая симптомы диабета 2 типа, можно выделить 3 основных:</p>
            <ul style="font-size:1.1rem; margin-left:3%">
                
                <li>1) Чрезмерная жажда
                Это состояние также известно как полидипсия; в сущности, это сохраняющееся желание пить воду несмотря на употребление ее адекватного количества в течение дня.</li>
                <li>2) Чрезмерный голод
                По аналогии с полидипсией этот симптом носит название полифагия. Сохраняющееся усиленное чувство голода на фоне недостатка физической активности может быть показателем наличия проблем в организме.</li>
                <li>3) Учащенное мочеиспускание
                Последний из трех главных симптомов и последнее «П» — это полиурия. Ее можно описать как необычное или нерегулярное мочеиспускание, сохраняющее такой характер изо дня в день.</li>

            </ul>
        </div>

        <div class="row mt-5">
            <p class="h4">Виды:</p>
            <p style="font-size:1.1rem; margin-left:3%">
                I. По степени тяжести:
                Лёгкая форма (характеризуется возможностью компенсации заболевания только диетой или диетой в сочетании с приёмом одной таблетки сахароснижающего препарата. Вероятность развития ангиопатий невелика).
                Средней степени тяжести (компенсация метаболических расстройств на фоне приёма 2—3 таблеток сахароснижающих препаратов. Возможно сочетание с функциональной стадией сосудистых осложнений).
                Тяжёлое течение (компенсация достигается комбинированным приёмом таблетированных сахароснижающих препаратов и инсулина либо только инсулинотерапией. На этой стадии отмечаются тяжёлые проявления сосудистых осложнений — органическая стадия развития ретинопатии, нефропатии, ангиопатии нижних конечностей; может диагностироваться энцефалопатия, тяжёлые проявления нейропатии).
                <br>II. По степени компенсации углеводного обмена:
                Фаза компенсации
                Фаза субкомпенсации
                Фаза декомпенсации
                <br>III. По наличию осложнений:
                Диабетическая микро- и макроангиопатия
                Диабетическая полинейропатия
                Диабетическая артропатия
                Диабетическая офтальмопатия, ретинопатия
                Диабетическая нефропатия
                Диабетическая энцефалопатия
            </p>
        </div>

        <div class="row mb-3 mt-3">
            <div class="col-sm"><button v-on:click="goToRec" class="btn backbtn" style="background-color: #11B46F;">Перейти к рекомендациям</button></div>
        </div>
    </div>
</template>

<script>
export default {
    methods:{
        back(){
            this.$router.go(-1);
        },
        goToRec(){
            this.$router.push({path:'/recomendation'})
        }
    }
}
</script>

<style scoped>
.backbtn{
    padding-top:0.5%;
    padding-bottom:0.5%;
    padding-left:5%;
    padding-right:5%;
    color:white;
    font-weight: 500;
}
</style>