<template>
    <div class="container">
        <div class="row" >
            <div class="col-sm-1">
                <a v-on:click="back" style="width:6%;height:6%;color:black;cursor: pointer;"> <img src="../assets/back.svg" alt=""> </a>
            </div>
            <div class="col-sm">
                <p class="h2" style="font-weight:600;">Деменция</p>
            </div>
        </div>

        <div class="row mt-5">
            <p class="lead">
                Деменция – это одна из разновидностей слабоумия, наиболее часто возникающая у пожилых людей. Состояние сопровождается постепенным снижением интеллекта и распадом личности, что в конечном итоге приводит к полной инвалидности. Своевременная диагностика, лечение и профилактические мероприятия позволяют значительно уменьшить скорость прогрессирования заболевания и дольше сохранить разум человека.
            </p>
        </div>
        <div class="row mt-5">
            <p class="h4">Причины и виды:</p>
            <p class="lead">
                Причинами деменции являются заболевания и состояния, вызывающие дегенерацию и гибель клеток головного мозга:
            </p>
            <ul style="font-size:1.1rem; margin-left:3%">
                <li>болезнь альцгеймера;</li>
                <li>болезнь Пика;</li>
                <li>тяжелое атеросклеротическое поражение сосудов шеи и головного мозга;</li>
                <li>геморрагические и ишемические инсульты, а также транзиторные ишемические атаки;</li>
                <li>тромбозы артерий;</li>
                <li>артериальная гипертензия в тяжелой форме;</li>
                <li>сахарный диабет (высокий глюкозы в крови становится причиной ангиопатии – поражения мелких сосудов с последующим кислородным голоданием);</li>
                <li>острые и хронические интоксикации (в том числе алкогольные);</li>
                <li>нейроинфекции (энцефалиты, менингиты);</li>
                <li>травмы головы (сотрясения, ушибы головного мозга);</li>
                <li>злокачественные и доброкачественные опухоли головного мозга.</li>
            </ul>
        </div>

        <div class="row mt-5">
            <p class="h4">Симптомы:</p>
            <ul style="font-size:1.1rem; margin-left:3%">
                    <li>снижение кратковременной памяти;</li>
                    <li>затруднение восприятия новой информации, обучения новым навыкам (например, работе с компьютером или смартфоном);</li>
                    <li>вязкость мышления: больной долго соображает, ему требуется больше времени для решения каких-либо задач или вопросов;</li>
                    <li>затруднения речи: невнятное произношение, трудности с подбором слов;</li>
                    <li>нарушения координации движений, особенно мелкой моторики;</li>
                    <li>неуверенность, шаткость походки;</li>
                    <li>неадекватное поведение: больные становятся излишне слащавыми или, наоборот, агрессивными;</li>
                    <li>дезориентацию в пространстве и времени.</li>
            </ul>
        </div>

        <div class="row mb-3 mt-3">
            <div class="col-sm"><button v-on:click="goToRec" class="btn backbtn" style="background-color: #11B46F;">Перейти к рекомендациям</button></div>
        </div>
    </div>
</template>

<script>
export default {
    methods:{
        back(){
            this.$router.go(-1);
        },
        goToRec(){
            this.$router.push({path:'/recomendation'})
        }
    }
}
</script>

<style scoped>
.backbtn{
    padding-top:0.5%;
    padding-bottom:0.5%;
    padding-left:5%;
    padding-right:5%;
    color:white;
    font-weight: 500;
}
</style>