<template>
    <div class="container">
        <div class="row" >
            <div class="col-sm-1">
                <a v-on:click="back" style="width:6%;height:6%;color:black;cursor: pointer;"> <img src="../assets/back.svg" alt=""> </a>
            </div>
            <div class="col-sm">
                <p class="h2" style="font-weight:600;">Артрит</p>
            </div>
        </div>

        <div class="row mt-5">
            <p class="lead">
                Артрит  — собирательное обозначение болезней (поражений) суставов воспалительной этиологии. Может быть основным заболеванием (например, спондилит) или проявлением другого заболевания (например ревматизма). Протекает в острой и хронической формах с поражением одного или нескольких (полиартрит) суставов. Среди причин различают инфекции (туберкулёз, бруцеллёз), обменные нарушения (например при подагре), травмы и др.
            </p>
        </div>
        <div class="row mt-5">
            <p class="h4">Основные причины:</p>
            <p class="lead">Некоторые причины артрита кроются в неправильном образе жизни:</p>
            <ul style="font-size:1.1rem; margin-left:3%">
                
                <li>недостаточное количество питательных веществ и витаминов;</li>
                <li>ннесбалансированное питание;</li>
                <li>нупотребление алкоголя;</li>
                <li>низбыточный вес;</li>
                <li>ннагрузка на суставы.</li>
                <li>нДругие более серьёзны, и их вряд ли удастся избежать обычной профилактикой:</li>
                <li>нбактериальные, грибковые;</li>
                <li>нвирусные инфекции;</li>
                <li>нпостоянное взаимодействие с аллергенами; </li>
                <li>нтравмы суставов; </li>
                <li>нзаболевания нервной и иммунной системы; </li>
                <li>ннарушение обмена веществ; </li>
                <li>нпатологии эндокринной железы; </li>
                <li>ннаследственная предрасположенность; </li>
                <li>ннекоторые болезни: подагра, гонорея, туберкулёз.</li>

            </ul>
            <p class="lead">
               Женщины болеют артритом чаще мужчин. Постоянный стресс, перенесённые болезни и оперативные вмешательства часто провоцируют первые приступы артрита. Также риск заболеть увеличивается с возрастом.
            </p>
        </div>

        <div class="row mt-5">
            <p class="h4">Симптомы артрита:</p>
            <ul style="font-size:1.1rem; margin-left:3%">
                
                <li>скованность движений утром после сна;</li>
                <li>характерная отечность с покраснением кожи;</li>
                <li>неестественный хруст сустава при движении;</li>
                <li>повышение температуры, припухлость в зоне воспаления;</li>
                <li>невозможность выполнять активные движения из-за сильного болевого синдрома;</li>
                <li>деформация сустава, которая видна визуально.</li>

            </ul>
        </div>

        <div class="row mb-3 mt-3">
            <div class="col-sm"><button v-on:click="goToRec" class="btn backbtn" style="background-color: #11B46F;">Перейти к рекомендациям</button></div>
        </div>
    </div>
</template>

<script>
export default {
    methods:{
        back(){
            this.$router.go(-1);
        },
        goToRec(){
            this.$router.push({path:'/recomendation'})
        }
    }
}
</script>

<style scoped>
.backbtn{
    padding-top:0.5%;
    padding-bottom:0.5%;
    padding-left:5%;
    padding-right:5%;
    color:white;
    font-weight: 500;
}
</style>